app/controllers/calendars_controller.rb

SELECT "events".* FROM "events" WHERE "events"."user_id" = ? AND "events"."start_time" BETWEEN ? AND ?  [["user_id", 8], ["start_time", "2024-04-08"], ["start_time", "2024-04-14"]]
---
    def show
      start_date = params.fetch(:start_date, Date.today).to_date
      @events = current_user.events.where(start_time: start_date.beginning_of_week..start_date.end_of_week)