app/controllers/events_controller.rb

  def create
    @event = Current.user.events.build(event_params)
    @event.deleted = false

    if @event.save
---
INSERT INTO "events" ("name", "start_time", "end_time", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"

  def find_event
    @event = Current.user.events.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]