app/controllers/registrations_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["email", "arjan@gorails.com"], ["password_digest", "[FILTERED]"], ["created_at", "2024-03-27 03:09:29.038917"], ["updated_at", "2024-03-27 03:09:29.038917"]]